"use strict";
/*
    Цикли (while, do while, for)
*/

/*
   while
*/

/*
    while (умова) {
      // код, тіло циклу (statement)
    }
*/
// Приклад з покроковим розбором

// let i = 0;

// while (i < 5) {
//   i = i + 1;
//   //   i += 1;
//   console.log(i);
// }

// i = 0 -> true
// i = 1

// i = 1 -> true
// i = 2

// i = 2 -> true
// i = 3

// i = 3 -> true
// i = 4

// i = 4 -> true
// i = 5

/*
 - Виведіть числа від 1 до 50
*/

// let num = 0;
// while(num < 50){
//     num += 1 // 50
//     console.log(num); // 50
// }

/*
 - Знайдіть суму чисел від 1 до 100
*/
// let i = 1;
// let sum = 0;
// while (i <= 100) {
//   sum += i;
//   i += 1;
// }
// console.log(sum);

/*
 - Дано число n=1000
 - Поділіть його на 2 стільки раз поки результат від ділення не стане менше 50
 - Яке число вийде
 - Порахуйте кількість ітерацій необхідних для цього та запишіть її в змінну num
*/
// let n = 1000;
// let num = 0;

// while (n > 50) {
//   n = n / 2;
// //   n /= 2;
//   num += 1;
// }
// console.log("n :>> ", n);
// console.log("num :>> ", num);

/*
    do while
*/

/*
    do {
        // statement
    } while (condition);
*/

// Приклад
// do {
//   console.log("do/while");
// } while (false === true);

/*
 - Напишіть цикл який пропонує ввести число більше 100
 - Якщо користувач ввів число менше 100, попросити його ввести число ще раз
 - Цикл повинен працювати до поки користувач не введе число більше 100
 - Припускається що користувач вводить тільки числа
*/
// let input = 0;
// do {
//   input = Number(prompt("Введіь число більше 100"));
// } while (input < 100); // false

/*
    for
*/

/*
    for (ініціалізація; умова; пост-вираз) {
     // тіло цикла
    }
*/

// Приклад

// const str = "qwe";
// for(let i = 0; i < str.length; i += 1){
//     console.log(str[i]);
// }

/*
 - За допомогою цикла for виведіть парні числа від 2 до 35
*/
// const num = 3

// for (let i = num; i <= 35; i += 1) {
//   if (i % 2 === 0) {
//     console.log(i);
//   }
// }

/*
 - Напишіть програму яка виводить в консоль числа від 1 до 100 з деякими виключеннями
 - Для чисел які діляться на 3 вивести значення "Fizz"
 - Для чисел які діляться на 5 - "Buzz"
 - Для чисел які діляться і на 3 і на 5 - "FizzBuzz"
*/

// for (let i = 1; i <= 100; i += 1) {
//   if (i % 3 === 0 && i % 5 === 0) {
//     console.log("FizzBuzz");
//   } else if (i % 5 === 0) {
//     console.log("Buzz");
//   } else if (i % 3 === 0) {
//     console.log("Fizz");
//   } else {
//     console.log(i);
//   }
// }

// 2й спосіб через конкатенацію
// for (let i = 1; i <= 100; i += 1) {
//   let str = "";
//   if (i % 3 === 0) {
//     // 6, 10, 15, 1
//     str += "Fizz";
//   }
//   if (i % 5 === 0) {
//     str += "Buzz";
//   }

//   console.log(str || i);
// }

/*
 - Виведіть методом concole.log() зірочки від 1 до 7 штук в вигляді трикутника таким чином
 *
 **
 ***
 ****
 *****
 ******
 *******
*/
// let str = "";
// for (let i = 1; i <= 7; i += 1) {
//   console.log((str += "*"));
// }
